Ran Plan for dir: `terraform/cloudflare/s61nov11.shinji.nishioka@gmail.com` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.nishiokatest_xyz will be created
+ resource "cloudflare_dns_record" "nishiokatest_xyz" {
      + content          = "90137deb-48e6-44f7-a59c-77b4da2117e9.cfargotunnel.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "*.nishiokatest.xyz"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "bc9c37d6196f46fd1a5d9099401de6d2"
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.this will be updated in-place
~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "this" {
      ~ config     = {
          ~ ingress = [
              ~ {
                  ~ hostname       = "*.muso-lab.dev" -> "*.nishiokatest.xyz"
                    # (2 unchanged attributes hidden)
                },
              ~ {
                  + hostname       = "*.muso-lab.dev"
                  + origin_request = {}
                  ~ service        = "http_status:404" -> "http://istio-ingress-gateway-istio.istio-ingress.svc.cluster.local"
                },
              + {
                  + service = "http_status:404"
                },
            ]
        }
      ~ created_at = "2026-03-08T13:11:40Z" -> (known after apply)
        id         = "90137deb-48e6-44f7-a59c-77b4da2117e9"
      ~ source     = "cloudflare" -> (known after apply)
      ~ version    = 12 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/cloudflare/s61nov11.shinji.nishioka@gmail.com
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.muso-lab.dev/lock?id=nishioka-shinji%252Fmy_infra%252Fterraform%252Fcloudflare%252Fs61nov11.shinji.nishioka%2540gmail.com%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/cloudflare/s61nov11.shinji.nishioka@gmail.com
  ```
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```